[
    {
        "id": 1,
        "title": "Advanced Robotics and Automation",
        "abstract": "Advanced Robotics and Automation (ARA) encompasses the use of sophisticated robots and automated systems across various sectors like manufacturing and healthcare...",
        "authors": "Alex Rivera, Casey Johnson, Pat Lee",
        "references": "Ref A1, Ref A2, Ref A3, Ref A4, Ref A5, Ref A6, Ref A7, Ref A8, Ref A9, Ref A10",
        "information": "Advanced Robotics and Automation (ARA) is a dynamic field at the forefront of technological innovation, transforming industries from manufacturing to healthcare...",
        "keywords": "Robotics, Automation, Technology, Innovation, AI, Machine Learning, Sensing, Control Systems, Humanoid Robots, Industrial Automation, Software, Hardware, Algorithms, Data Processing, Neural Networks, Precision, Mechanics, Design, Manufacturing, Safety",
        "publishedBy": "Alex Rivera / Prof. Jonathan Kim",
        "numberOfDownloads": 500,
        "numberOfLikes": 300,
        "numberOfViews": 1500,
        "uploadDate": "2023-01-10"
    },
    {
        "id": 2,
        "title": "Neural Networks in Finance",
        "abstract": "Neural Networks in Finance leverage sophisticated AI to analyze and predict financial trends...",
        "authors": "Beth Harmon, Sam Knight",
        "references": "Ref B1, Ref B2, Ref B3, Ref B4, Ref B5, Ref B6, Ref B7, Ref B8, Ref B9, Ref B10",
        "information": "Neural Networks in Finance are revolutionizing the way financial data is analyzed and interpreted...",
        "keywords": "Neural Networks, Finance, Algorithms, Machine Learning, Data Analysis, Prediction, Stock Markets, Trading, Risk Management, Portfolio Optimization, AI, Deep Learning, Backpropagation, Supervised Learning, Unsupervised Learning, Reinforcement Learning, Data Science, Statistics, Econometrics, Fintech",
        "publishedBy": "Beth Harmon / Prof. Sarah Connor",
        "numberOfDownloads": 780,
        "numberOfLikes": 410,
        "numberOfViews": 1620,
        "uploadDate": "2023-02-15"
    },
    {
        "id": 3,
        "title": "Genomics and Biotechnology",
        "abstract": "This thesis investigates the intersection of genomics with modern biotechnology...",
        "authors": "Charles Darwin, Gregor Mendel",
        "references": "Ref C1, Ref C2, Ref C3, Ref C4, Ref C5, Ref C6, Ref C7, Ref C8, Ref C9, Ref C10",
        "information": "The field of genomics has drastically changed with the advent of biotechnological advancements...",
        "keywords": "Genomics, Biotechnology, DNA, RNA, Gene Editing, CRISPR, Sequencing, Bioinformatics, Genetics, Molecular Biology, Cellular Processes, Gene Therapy, Genetic Engineering, Cloning, Evolution, Biochemical, Pathways, Chromosomes, Genome Mapping, Genetic Markers, Proteomics",
        "publishedBy": "Charles Darwin / Prof. Richard Dawkins",
        "numberOfDownloads": 620,
        "numberOfLikes": 290,
        "numberOfViews": 1100,
        "uploadDate": "2023-03-20"
    },
    {
        "id": 4,
        "title": "Sustainable Energy Solutions",
        "abstract": "This thesis presents an analysis of sustainable energy solutions for the future...",
        "authors": "Diana Prince, Clark Kent, Bruce Wayne",
        "references": "Ref D1, Ref D2, Ref D3, Ref D4, Ref D5, Ref D6, Ref D7, Ref D8, Ref D9, Ref D10",
        "information": "Sustainable energy solutions are essential for the global transition towards a sustainable future...",
        "keywords": "Sustainable Energy, Solar Power, Wind Energy, Renewable Resources, Environmental Impact, Green Technology, Bioenergy, Hydropower, Geothermal Energy, Energy Storage, Carbon Footprint, Energy Efficiency, Climate Change, Global Warming, Policy, Regulations, Smart Grids, Electric Vehicles, Hydrogen Fuel, Biomass",
        "publishedBy": "Diana Prince / Prof. Harvey Dent",
        "numberOfDownloads": 940,
        "numberOfLikes": 520,
        "numberOfViews": 2300,
        "uploadDate": "2023-04-25"
    },
    {
        "id": 5,
        "title": "Artificial Intelligence in Healthcare",
        "abstract": "This thesis delves into the role of artificial intelligence in revolutionizing healthcare...",
        "authors": "Eve Polastri, Villanelle",
        "references": "Ref E1, Ref E2, Ref E3, Ref E4, Ref E5, Ref E6, Ref E7, Ref E8, Ref E9, Ref E10",
        "information": "Artificial intelligence is increasingly becoming integral to healthcare, offering solutions...",
        "keywords": "Artificial Intelligence, Healthcare, Machine Learning, Diagnosis, Treatment, Data Analysis, Medical Imaging, Robotics, Personalized Medicine, Predictive Analytics, Drug Discovery, Patient Care, Health Records, Neural Networks, Deep Learning, Biostatistics, Telemedicine, Ethics, Regulation, Clinical Trials",
        "publishedBy": "Eve Polastri / Prof. Carolyn Martens",
        "numberOfDownloads": 860,
        "numberOfLikes": 635,
        "numberOfViews": 2400,
        "uploadDate": "2023-05-30"
    },
    {
        "id": 6,
        "title": "Cybersecurity in the Age of IoT",
        "abstract": "This thesis explores the challenges and solutions related to cybersecurity in the IoT era...",
        "authors": "Finn Smith, Rey Thompson",
        "references": "Ref F1, Ref F2, Ref F3, Ref F4, Ref F5, Ref F6, Ref F7, Ref F8, Ref F9, Ref F10",
        "information": "With the proliferation of Internet of Things (IoT) devices, cybersecurity has become an increasingly critical issue...",
        "keywords": "Cybersecurity, IoT, Internet of Things, Network Security, Data Protection, Encryption, Firewalls, Malware, Phishing, Threat Detection, Risk Management, Blockchain, Cloud Computing, Smart Devices, Home Automation, Industrial IoT, Wearables, Data Privacy, Hacking, Security Protocols",
        "publishedBy": "Finn Smith / Prof. Leia Organa",
        "numberOfDownloads": 430,
        "numberOfLikes": 220,
        "numberOfViews": 890,
        "uploadDate": "2023-06-15"
    },
    {
        "id": 7,
        "title": "Quantum Computing and Cryptography",
        "abstract": "This thesis discusses the impact of quantum computing on cryptography...",
        "authors": "Gina Bellman, Sophie Devereaux",
        "references": "Ref G1, Ref G2, Ref G3, Ref G4, Ref G5, Ref G6, Ref G7, Ref G8, Ref G9, Ref G10",
        "information": "Quantum computing promises to revolutionize various sectors, with a significant impact on cryptography...",
        "keywords": "Quantum Computing, Cryptography, Quantum Entanglement, Quantum Algorithms, Shor's Algorithm, Grover's Algorithm, Quantum Key Distribution, Data Security, Encryption, Decryption, Quantum Mechanics, Theoretical Physics, Superposition, Quantum Bits, Error Correction, Quantum Internet, Quantum Supremacy, Blockchain, Cybersecurity, Privacy",
        "publishedBy": "Gina Bellman / Prof. Nathan Ford",
        "numberOfDownloads": 375,
        "numberOfLikes": 195,
        "numberOfViews": 730,
        "uploadDate": "2023-07-05"
    },
    {
        "id": 8,
        "title": "Data Science and Big Data Analytics",
        "abstract": "This thesis examines the expansive field of data science and its application in big data analytics...",
        "authors": "Harry Potter, Hermione Granger",
        "references": "Ref H1, Ref H2, Ref H3, Ref H4, Ref H5, Ref H6, Ref H7, Ref H8, Ref H9, Ref H10",
        "information": "Data science and big data analytics are pivotal in extracting meaningful insights from large datasets...",
        "keywords": "Data Science, Big Data, Analytics, Machine Learning, Statistical Analysis, Data Mining, Visualization, AI, Algorithms, Predictive Modeling, Business Intelligence, Cloud Computing, Data Warehousing, ETL, Data Governance, Privacy, Security, Decision Support, Natural Language Processing, IoT",
        "publishedBy": "Harry Potter / Prof. Albus Dumbledore",
        "numberOfDownloads": 690,
        "numberOfLikes": 460,
        "numberOfViews": 2100,
        "uploadDate": "2023-08-20"
    },
    {
        "id": 9,
        "title": "Virtual Reality and Augmented Reality",
        "abstract": "This thesis explores the development and implications of virtual and augmented reality technologies...",
        "authors": "Indiana Jones, Marion Ravenwood",
        "references": "Ref I1, Ref I2, Ref I3, Ref I4, Ref I5, Ref I6, Ref I7, Ref I8, Ref I9, Ref I10",
        "information": "Virtual and augmented reality technologies are transforming how we interact with digital content...",
        "keywords": "Virtual Reality, Augmented Reality, VR, AR, 3D Modeling, Immersive Technology, Simulation, Gaming, Education, Training, Healthcare, Real Estate, Marketing, User Experience, Interface Design, Haptic Feedback, Motion Tracking, Eye Tracking, Mixed Reality, Wearables",
        "publishedBy": "Indiana Jones / Prof. Marcus Brody",
        "numberOfDownloads": 470,
        "numberOfLikes": 350,
        "numberOfViews": 980,
        "uploadDate": "2023-09-10"
    },
    {
        "id": 10,
        "title": "Blockchain Technology and Its Applications",
        "abstract": "This thesis addresses the wide-ranging applications of blockchain technology across various sectors...",
        "authors": "Jack Sparrow, Elizabeth Swann",
        "references": "Ref J1, Ref J2, Ref J3, Ref J4, Ref J5, Ref J6, Ref J7, Ref J8, Ref J9, Ref J10",
        "information": "Blockchain technology is increasingly being recognized for its potential beyond cryptocurrency...",
        "keywords": "Blockchain, Cryptocurrency, Bitcoin, Ethereum, Smart Contracts, Decentralization, Ledger Technology, Fintech, Security, Transparency, Supply Chain Management, Voting Systems, Data Integrity, Financial Services, Tokenization, ICOs, DAOs, NFTs, Regulatory Issues, Digital Identity",
        "publishedBy": "Jack Sparrow / Prof. Hector Barbossa",
        "numberOfDownloads": 523,
        "numberOfLikes": 421,
        "numberOfViews": 1100,
        "uploadDate": "2023-09-15"
    },
    {
        "id": 11,
        "title": "The Role of AI in Modern Agriculture",
        "abstract": "This thesis investigates the utilization of AI technologies in enhancing agricultural productivity and sustainability...",
        "authors": "Charles Darwin, Eve Polastri",
        "references": "Ref K1, Ref K2, Ref K3, Ref K4, Ref K5, Ref K6, Ref K7, Ref K8, Ref K9, Ref K10",
        "information": "AI technologies are becoming integral to modern agriculture, from precision farming to crop monitoring...",
        "keywords": "Artificial Intelligence, Agriculture, Precision Farming, Crop Monitoring, Sustainability, Yield Prediction, Machine Learning, Data Analysis, Robotics, Drone Technology, Environmental Impact, Soil Health, Water Conservation, Farm Management, Remote Sensing, Crop Simulation, Agricultural Robotics, Decision Support Systems, Farm Data, AI Applications",
        "publishedBy": "Charles Darwin / Prof. Emma Woodhouse",
        "numberOfDownloads": 340,
        "numberOfLikes": 215,
        "numberOfViews": 900,
        "uploadDate": "2023-01-25"
    },
    {
        "id": 12,
        "title": "Machine Learning in Weather Prediction",
        "abstract": "This study explores the application of machine learning techniques in predicting weather patterns...",
        "authors": "Hermione Granger, Casey Johnson",
        "references": "Ref L1, Ref L2, Ref L3, Ref L4, Ref L5, Ref L6, Ref L7, Ref L8, Ref L9, Ref L10",
        "information": "Machine learning is increasingly used in meteorology for its potential to improve the accuracy of weather forecasts...",
        "keywords": "Machine Learning, Weather Prediction, Data Analysis, Forecasting, Meteorology, AI, Algorithms, Statistical Models, Climate Modeling, Real-time Data, Atmospheric Sciences, Precipitation Forecasting, Temperature Forecasting, Seasonal Patterns, Weather Events, Computational Models, Data Acquisition, Data Processing, Weather Stations, Neural Networks",
        "publishedBy": "Hermione Granger / Prof. Minerva McGonagall",
        "numberOfDownloads": 500,
        "numberOfLikes": 300,
        "numberOfViews": 1400,
        "uploadDate": "2023-02-28"
    },
    {
        "id": 13,
        "title": "Ethics of Genetic Engineering",
        "abstract": "This thesis delves into the ethical considerations of genetic engineering and its societal implications...",
        "authors": "Gregor Mendel, Beth Harmon",
        "references": "Ref M1, Ref M2, Ref M3, Ref M4, Ref M5, Ref M6, Ref M7, Ref M8, Ref M9, Ref M10",
        "information": "Genetic engineering raises significant ethical questions, especially regarding its applications in humans...",
        "keywords": "Genetic Engineering, Ethics, Biotechnology, Society, Moral Considerations, CRISPR, Gene Editing, Human Genetics, Regulatory Frameworks, Ethical Dilemmas, Public Perception, Genetic Modification, Reproductive Technologies, Genetic Diversity, Medical Ethics, Consent, Privacy, Biopolitics, Genetic Counseling, Policy",
        "publishedBy": "Gregor Mendel / Prof. James Watson",
        "numberOfDownloads": 290,
        "numberOfLikes": 180,
        "numberOfViews": 820,
        "uploadDate": "2023-03-15"
    },
    {
        "id": 14,
        "title": "Advancements in Smart Grid Technology",
        "abstract": "This thesis examines recent advancements in smart grid technology and its impact on energy systems...",
        "authors": "Diana Prince, Finn Smith",
        "references": "Ref N1, Ref N2, Ref N3, Ref N4, Ref N5, Ref N6, Ref N7, Ref N8, Ref N9, Ref N10",
        "information": "Smart grid technology is crucial for the integration of renewable energy sources and enhancing grid reliability...",
        "keywords": "Smart Grids, Energy Systems, Renewable Energy, Grid Technology, Electricity Distribution, Automation, Energy Management, Grid Stability, Power Systems, Communication Technologies, IoT, Cybersecurity, Energy Storage, Demand Response, Smart Meters, Grid Infrastructure, Power Quality, Network Optimization, Grid Resilience, Energy Transition",
        "publishedBy": "Diana Prince / Prof. Nikola Tesla",
        "numberOfDownloads": 680,
        "numberOfLikes": 450,
        "numberOfViews": 1800,
        "uploadDate": "2023-04-10"
    },
    {
        "id": 15,
        "title": "Impact of Virtual Reality on Education",
        "abstract": "Exploring the transformative impact of virtual reality technologies in educational settings...",
        "authors": "Indiana Jones, Harry Potter",
        "references": "Ref O1, Ref O2, Ref O3, Ref O4, Ref O5, Ref O6, Ref O7, Ref O8, Ref O9, Ref O10",
        "information": "Virtual reality offers new ways to engage students and enhance learning experiences across various educational levels...",
        "keywords": "Virtual Reality, Education, Immersive Learning, VR in Schools, Student Engagement, Interactive Learning, Digital Classrooms, Educational Technology, Simulation, Training, Curriculum Development, Learning Outcomes, Teacher Tools, VR Content, Educational Games, Distance Learning, E-Learning, Educational Strategies, Technology Integration, Pedagogy",
        "publishedBy": "Indiana Jones / Prof. Henry Jones Jr.",
        "numberOfDownloads": 560,
        "numberOfLikes": 410,
        "numberOfViews": 1500,
        "uploadDate": "2023-05-15"
    },
    {
        "id": 16,
        "title": "Innovations in 3D Bioprinting",
        "abstract": "This thesis investigates the latest innovations in 3D bioprinting and its applications in medicine...",
        "authors": "Sophie Devereaux, Villanelle",
        "references": "Ref P1, Ref P2, Ref P3, Ref P4, Ref P5, Ref P6, Ref P7, Ref P8, Ref P9, Ref P10",
        "information": "3D bioprinting is revolutionizing medical research and patient care, offering new possibilities for tissue engineering and regenerative medicine...",
        "keywords": "3D Bioprinting, Medicine, Tissue Engineering, Regenerative Medicine, Organ Printing, Biomedical Applications, Biofabrication, Cellular Structures, Biocompatibility, Biomaterials, Tissue Models, Drug Testing, Surgical Planning, Personalized Medicine, Bioprinters, Printing Technologies, Biomimicry, Ethical Considerations, Clinical Trials, Biomedical Research",
        "publishedBy": "Sophie Devereaux / Prof. Victor Frankenstein",
        "numberOfDownloads": 410,
        "numberOfLikes": 330,
        "numberOfViews": 1050,
        "uploadDate": "2023-06-10"
    },
    {
        "id": 17,
        "title": "Blockchain for Secure Healthcare Systems",
        "abstract": "This thesis explores the potential of blockchain technology in enhancing the security and privacy of healthcare systems...",
        "authors": "Eve Polastri, Jack Sparrow",
        "references": "Ref Q1, Ref Q2, Ref Q3, Ref Q4, Ref Q5, Ref Q6, Ref Q7, Ref Q8, Ref Q9, Ref Q10",
        "information": "Blockchain technology can significantly improve data security and patient privacy in healthcare, offering a decentralized approach to medical record management...",
        "keywords": "Blockchain, Healthcare, Data Security, Privacy, Medical Records, Decentralized Systems, Patient Data, Health Information Exchange, Data Integrity, Encryption, Access Control, Compliance, Cybersecurity, Data Protection, Trust, Interoperability, Electronic Health Records, Blockchain Applications, Technology Adoption, Regulatory Environment",
        "publishedBy": "Eve Polastri / Prof. Alan Turing",
        "numberOfDownloads": 470,
        "numberOfLikes": 310,
        "numberOfViews": 1220,
        "uploadDate": "2023-07-25"
    },
    {
        "id": 18,
        "title": "AI in Sports Analytics",
        "abstract": "This thesis examines the role of artificial intelligence in transforming sports analytics and performance monitoring...",
        "authors": "Harry Potter, Beth Harmon",
        "references": "Ref R1, Ref R2, Ref R3, Ref R4, Ref R5, Ref R6, Ref R7, Ref R8, Ref R9, Ref R10",
        "information": "AI is increasingly used in sports for enhancing player performance and strategic decision-making...",
        "keywords": "Artificial Intelligence, Sports Analytics, Performance Monitoring, Data Analysis, Machine Learning, Predictive Analytics, Biometrics, Training, Athlete Performance, Team Strategy, Game Analysis, Player Health, Sports Management, Coaching Tools, Statistical Models, Video Analysis, Wearable Technology, Fitness Tracking, Injury Prevention, Sports Science",
        "publishedBy": "Harry Potter / Prof. Pierre de Coubertin",
        "numberOfDownloads": 530,
        "numberOfLikes": 295,
        "numberOfViews": 1320,
        "uploadDate": "2023-08-30"
    },
    {
        "id": 19,
        "title": "Deep Learning for Autonomous Vehicles",
        "abstract": "Investigating the applications of deep learning technologies in the development of autonomous vehicle systems...",
        "authors": "Clark Kent, Rey Thompson",
        "references": "Ref S1, Ref S2, Ref S3, Ref S4, Ref S5, Ref S6, Ref S7, Ref S8, Ref S9, Ref S10",
        "information": "Deep learning is a key driver in the advancement of autonomous vehicle technology, providing systems with the ability to make real-time decisions...",
        "keywords": "Deep Learning, Autonomous Vehicles, AI, Machine Learning, Self-Driving Cars, Neural Networks, Computer Vision, Object Detection, Path Planning, Sensor Fusion, Real-Time Systems, Data Processing, Navigation, Vehicle Control, Safety Systems, Lidar, Radar, Image Recognition, Simulation, Automotive Technology",
        "publishedBy": "Clark Kent / Prof. Emmett Brown",
        "numberOfDownloads": 620,
        "numberOfLikes": 410,
        "numberOfViews": 1780,
        "uploadDate": "2023-09-25"
    },
    {
        "id": 20,
        "title": "Internet of Things for Smart Cities",
        "abstract": "This thesis explores the implementation of Internet of Things (IoT) technologies in the development of smart cities...",
        "authors": "Finn Smith, Bruce Wayne",
        "references": "Ref T1, Ref T2, Ref T3, Ref T4, Ref T5, Ref T6, Ref T7, Ref T8, Ref T9, Ref T10",
        "information": "IoT technologies are crucial in the creation of smart cities, enhancing urban infrastructure and resident life quality...",
        "keywords": "Internet of Things, Smart Cities, IoT Devices, Urban Development, Smart Infrastructure, Connectivity, Automation, Energy Management, Traffic Control, Public Safety, Environmental Monitoring, Urban Planning, Data Collection, Sensor Networks, Smart Lighting, Waste Management, Water Management, Smart Grids, City Planning, Technology Integration",
        "publishedBy": "Finn Smith / Prof. Thomas Wayne",
        "numberOfDownloads": 530,
        "numberOfLikes": 340,
        "numberOfViews": 1600,
        "uploadDate": "2023-10-05"
    }
]